package ru.job4j.oop;

public class Fox {
    public void eat(Ball ball) {
        System.out.println("Лиса: — Колобок, Колобок, куда катишься?");
        System.out.println("Колобок:— Качусь по дорожке.");
        System.out.println("Лиса: — Колобок, Колобок, спой мне песенку!");
        System.out.println("Колобок: — Я Колобок, Колобок,\n" +
                "Я по коробу скребен,\n"
                + "По сусеку метен,\n"
                + "На сметане мешон\n"
                + "Да в масле пряжон,\n"
                + "На окошке стужон.\n"
                + "Я от дедушки ушел,\n"
                + "Я от бабушки ушел,\n"
                + "Я от зайца ушел,\n"
                + "Я от волка ушел,\n"
                + "От медведя ушел,\n"
                + "От тебя, лисы, нехитро уйти!");
        System.out.println("Лиса: — Ах, песенка хороша, да слышу я плохо. Колобок, Колобок, сядь ко мне на носок да спой еще разок, погромче.");
        System.out.println("Лиса: — Колобок, Колобок, сядь ко мне на язычок да пропой в последний разок.");
        System.out.println("Лиса: — гам! Вкусный был Колобок");
    }
    }
