package ru.job4j.oop;

public class Hare {
    public void tryEat(Ball ball) {
        System.out.println("Заяц: — Колобок, Колобок, я тебя съем!");
        System.out.println("Колобок: — Не ешь меня, Заяц, я тебе песенку спою:\n" +
                "\n"
                + "Я Колобок, Колобок,\n"
                + "Я по коробу скребен,\n"
                + "По сусеку метен,\n"
                + "На сметане мешон\n"
                + "Да в масле пряжон,\n"
                + "На окошке стужон.\n"
                + "Я от дедушки ушел,\n"
                + "Я от бабушки ушел,\n"
                + "От тебя, зайца, подавно уйду!");
    }
}
