package ru.job4j.oop;

public class Wolf {
    public void tryEat(Ball ball) {
        System.out.println("Волк: — Колобок, Колобок, я тебя съем!");
        System.out.println("Колобок: — Не ешь меня, Серый Волк, я тебе песенку спою:\n"
                +
                "\n"
                + "Я Колобок, Колобок,\n"
                + "Я по коробу скребен,\n"
                + "По сусеку метен,\n"
                + "На сметане мешон\n"
                + "Да в масле пряжон,\n"
                + "На окошке стужон.\n"
                + "Я от дедушки ушел,\n"
                + "Я от бабушки ушел,\n"
                + "Я от зайца ушел,\n"
                + "От тебя, волк, подавно уйду!");
    }
}